20200717.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-07-23 Thu 13:47 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>1594995475</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="stormrider" />
<link href="https://fonts.googleapis.com/css2?family=Raleway&display=swap" rel="stylesheet" />
<link rel="stylesheet" type="text/css" href="css/stylesheet.css" />
</head>
<body>
<div id="content">
<h1 class="title">1594995475</h1>
<div class="org-center">
<p>
<a href="blog.html">blog</a>  <code>~</code>   <a href="journal.html">journal</a>   <code>~</code>   <a href="doc.html">doc</a>   <code>~</code> <a href="code.html">code</a> <code>~</code> <a href="index.html">home</a>
</p>
</div>

<div id="outline-container-org8934863" class="outline-2">
<h2 id="org8934863">personal journal of stormrider</h2>
<div class="outline-text-2" id="text-org8934863">
<p>
Fri, Jul 17, 2020 / 1594995475
 / Pungenday, Confusion 52, 3186 YOLD
</p>
</div>

<div id="outline-container-org2567f68" class="outline-3">
<h3 id="org2567f68">fortune -s</h3>
<div class="outline-text-3" id="text-org2567f68">
<p>
It may or may not be worthwhile, but it still has to be done.
</p>
</div>
</div>

<div id="outline-container-org08ffd03" class="outline-3">
<h3 id="org08ffd03">daily journal</h3>
<div class="outline-text-3" id="text-org08ffd03">
</div>
<div id="outline-container-org27e58ed" class="outline-4">
<h4 id="org27e58ed"><b><span class="timestamp-wrapper"><span class="timestamp">&lt;2020-07-17 Fri 09:24&gt;</span></span></b></h4>
<div class="outline-text-4" id="text-org27e58ed">
<p>
crazy morning, but slept really well; i'm beginning to be okay with this sleeping thing, just need to either trim it back in the direction of getting up earlier, or go ahead and stay up later and use that time a little more wisely.  i can work on that tomorrow morning some. meanwhile, i don't need to forget to freeze the meat today, without fail, probably at lunch.
</p>
</div>
</div>

<div id="outline-container-orga77f8eb" class="outline-4">
<h4 id="orga77f8eb"><b><span class="timestamp-wrapper"><span class="timestamp">&lt;2020-07-17 Fri 11:18&gt;</span></span></b></h4>
<div class="outline-text-4" id="text-orga77f8eb">
<p>
work morning full of administrivia, just a lot of little things that seem to pile up over the week; good standup today, and now i have the weekend to get busy on my passions.  i would imagine my wife will be tired from a very long week, so she probably won't be in much of a mood to hang out tonight, which means i should plan something to work on so that i won't be an annoyance as she tries to get some quiet and rest.
</p>
</div>
</div>

<div id="outline-container-org7911f15" class="outline-4">
<h4 id="org7911f15"><b><span class="timestamp-wrapper"><span class="timestamp">&lt;2020-07-17 Fri 12:57&gt;</span></span></b></h4>
<div class="outline-text-4" id="text-org7911f15">
<p>
average lunch for a friday, a copule of hot pockets; just not much into housework-type things today, really want to get on to coding and writing, but had some trivia to take care of this morning; my wife works tomorrow, so it'll probably be a day spent at the keyboards.
</p>
</div>
</div>
<div id="outline-container-org0bb15ca" class="outline-4">
<h4 id="org0bb15ca"><b><span class="timestamp-wrapper"><span class="timestamp">&lt;2020-07-17 Fri 20:49&gt;</span></span></b></h4>
<div class="outline-text-4" id="text-org0bb15ca">
<p>
okay-bie, then!  got a really cool result for my <a href="http://stormrider.io/maas-rad/maas-documentation-25.html">RAD project</a> today, the product of a great week's work.  very nice; still a lot of work to do, and still a lot of work i <i>want</i> to do, but it's a truly great start.  most of this is automated, btw, only one 90m session to fix some bad (legacy) links in the markdown, everything else was done by my publishing tool <code>xpub</code>, which i need to blog about today.
</p>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: stormrider</p>
<p class="date">Created: 2020-07-23 Thu 13:47</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
